[
  "  id: \"adaptacion-cambio\",\n    title: \"Adaptación al Cambio\",\n    description: \"Flexibilidad ante nuevas situaciones y cooperación activa en su implementación.\",\n    intro:\n      \"Evalúa cómo respondes ante cambios organizacionales, la disposición para apoyar nuevas decisiones y la capacidad de guiar a tu equipo durante las transiciones.\",\n    reference: \"Sección 2.6 del Decreto 815 de 2018 - Adaptación al Cambio.\",\n    questions: [\n      {\n        id: \"adaptacion-cambio-1\",\n        text: \"Según el decreto, ¿qué actitud demuestra mejor la adaptación al cambio dentro de una entidad pública?\",\n        options: [\n          { value: \"a\", label: \"Resistir nuevas decisiones hasta recibir instrucciones detalladas.\" },\n          { value: \"b\", label: \"Aceptar con flexibilidad las nuevas situaciones y apoyar activamente su implementación.\" },\n          { value: \"c\", label: \"Delegar el ajuste del equipo a un tercero externo para evitar conflictos.\" },\n          { value: \"d\", label: \"Suspender temporalmente procesos hasta que las novedades estén completamente probadas.\" },\n        ],\n        correctOption: \"b\",\n        score: 10,\n        explanation:\n          \"El decreto resalta que la Adaptación al Cambio implica aceptar y responder con flexibilidad, apoyando activamente las decisiones adoptadas por la entidad.\",\n        review:\n          \"Refuerza la lectura de la sección Adaptación al Cambio: apoyar activamente las decisiones y promover la flexibilidad del equipo es clave.\",\n      },",
  "  id: \"aporte-tecnico\",\n    title: \"Aporte Técnico - Profesional\",\n    description: \"Contribución de conocimientos especializados para anticipar y resolver problemas.\",\n    intro:\n      \"Pon a prueba tu capacidad para aportar soluciones técnicas, anticipar problemas y aprovechar la interdisciplinariedad dentro de tu rol profesional.\",\n    reference: \"Sección 3.1 del Decreto 815 de 2018 - Aporte técnico-profesional.\",\n    questions: [\n      {\n        id: \"aporte-tecnico-1\",\n        text: \"¿Qué conducta ejemplifica el aporte técnico-profesional según el decreto?\",\n        options: [\n          { value: \"a\", label: \"Aplicar únicamente las instrucciones recibidas sin proponer alternativas.\" },\n          { value: \"b\", label: \"Anticipar problemas previsibles y aportar soluciones relacionadas con su experiencia especializada.\" },\n          { value: \"c\", label: \"Remitir decisiones técnicas a otros niveles jerárquicos para evitar responsabilidad.\" },\n          { value: \"d\", label: \"Limitarse a documentar situaciones sin intervenir en ellas.\" },\n        ],\n        correctOption: \"b\",\n        score: 10,\n        explanation:\n          \"El aporte técnico-profesional exige poner a disposición saberes especializados, anticipar problemas y proponer soluciones basadas en ellos.\",\n        review:\n          \"Repasa la sección de Aporte técnico-profesional: anticipar problemas y proponer soluciones es central a esta competencia.\",\n      },",
  "  id: \"aprendizaje-continuo\",\n    title: \"Aprendizaje Continuo\",\n    description: \"Actualización permanente mediante fuentes confiables y espacios de capacitación.\",\n    intro:\n      \"Identifica conductas que mantienen tus competencias al día, promueven el intercambio de saberes y garantizan la efectividad del servicio público.\",\n    reference: \"Sección 2.1 del Decreto 815 de 2018 - Aprendizaje continuo.\",\n    questions: [\n      {\n        id: \"aprendizaje-continuo-1\",\n        text: \"Mantener actualizadas las competencias implica principalmente:\",\n        options: [\n          { value: \"a\", label: \"Esperar las capacitaciones obligatorias de la entidad.\" },\n          { value: \"b\", label: \"Buscar y aplicar nuevos conocimientos acordes con los cambios de la administración pública.\" },\n          { value: \"c\", label: \"Documentar aprendizajes sin llevarlos a la práctica.\" },\n          { value: \"d\", label: \"Delegar la actualización a los superiores inmediatos.\" },\n        ],\n        correctOption: \"b\",\n        score: 10,\n        explanation:\n          \"El decreto señala que se deben identificar, incorporar y aplicar nuevos conocimientos para mantener la efectividad de las prácticas.\",\n        review:\n          \"Repasa la definición de Aprendizaje continuo: aplicar lo aprendido en el trabajo es indispensable.\",\n      },",
  "  id: \"compromiso-organizacion\",\n    title: \"Compromiso con la Organización\",\n    description: \"Aplicación cotidiana de los valores del Código de Integridad del Servicio Público Colombiano.\",\n    intro:\n      \"Explora cómo vivir la honestidad, el respeto, el compromiso, la diligencia y la justicia definidos por el Código de Integridad para orientar cada decisión en el servicio público.\",\n    reference: \"Código de Integridad del Servicio Público Colombiano – DAFP (2017).\",\n    questions: [\n      {\n        id: \"compromiso-organizacion-1\",\n        text: \"¿Cuál es el propósito central del Código de Integridad del Servicio Público Colombiano?\",\n        options: [\n          { value: \"a\", label: \"Sustituir el Código Disciplinario Único con un catálogo de sanciones penales.\" },\n          {\n            value: \"b\",\n            label: \"Servir como guía pedagógica que complementa la normativa para promover compromisos éticos cotidianos.\",\n          },\n          { value: \"c\", label: \"Reemplazar los manuales de funciones y procedimientos de cada entidad pública.\" },\n          { value: \"d\", label: \"Otorgar beneficios económicos a quienes se adhieran formalmente al código.\" },\n        ],\n        correctOption: \"b\",\n        score: 10,\n        explanation:\n          \"El Código se concibe como un instrumento pedagógico y preventivo que orienta las actuaciones diarias, complementando la normatividad existente.\",\n        review: \"Revisa la introducción del Código de Integridad para recordar su naturaleza pedagógica y preventiva.\",\n      },",
  "  id: \"comunicacion-efectiva\",\n    title: \"Comunicación Efectiva\",\n    description: \"Intercambio claro, preciso y empático con superiores, pares y ciudadanos.\",\n    intro:\n      \"Pon a prueba tu capacidad para comunicarte con claridad, escuchar activamente y responder con oportunidad en contextos institucionales.\",\n    reference: \"Sección 3.2 del Decreto 815 de 2018 - Comunicación efectiva.\",\n    questions: [\n      {\n        id: \"comunicacion-efectiva-1\",\n        text: \"Redactar informes claros y comprensibles permite:\",\n        options: [\n          { value: \"a\", label: \"Substituir la comunicación verbal en la entidad.\" },\n          { value: \"b\", label: \"Facilitar la comprensión de la información y apoyar la toma de decisiones informada.\" },\n          { value: \"c\", label: \"Limitar la participación de los ciudadanos en los procesos.\" },\n          { value: \"d\", label: \"Evitar el uso de otros canales de comunicación.\" },\n        ],\n        correctOption: \"b\",\n        score: 10,\n        explanation:\n          \"La comunicación efectiva exige claridad escrita para que la información sea comprensible y útil en las decisiones institucionales.\",\n        review:\n          \"Revisa la competencia de Comunicación efectiva: la claridad escrita respalda decisiones y transparencia.\",\n      },",
  "  id: \"gestion-procedimientos\",\n    title: \"Gestión de Procedimientos\",\n    description: \"Ejecución y mejora continua de procesos dentro de los lineamientos vigentes.\",\n    intro:\n      \"Evalúa tu capacidad para seguir protocolos, proponer mejoras y asegurar la calidad en la ejecución de los procedimientos institucionales.\",\n    reference: \"Sección 3.3 del Decreto 815 de 2018 - Gestión de procedimientos.\",\n    questions: [\n      {\n        id: \"gestion-procedimientos-1\",\n        text: \"Una conducta alineada con la gestión de procedimientos consiste en:\",\n        options: [\n          { value: \"a\", label: \"Ejecutar las tareas según criterios de calidad establecidos y protocolos vigentes.\" },\n          { value: \"b\", label: \"Modificar procedimientos sin comunicarlo para agilizar resultados.\" },\n          { value: \"c\", label: \"Priorizar la velocidad sobre el cumplimiento de normas.\" },\n          { value: \"d\", label: \"Esperar nuevas instrucciones para iniciar cada actividad.\" },\n        ],\n        correctOption: \"a\",\n        score: 10,\n        explanation:\n          \"El decreto establece que la gestión de procedimientos implica ejecutar tareas conforme a los criterios de calidad y protocolos definidos.\",\n        review:\n          \"Lee la sección Gestión de procedimientos: cumplir criterios de calidad y protocolos es innegociable.\",\n      },",
  "  id: \"instrumentacion-decisiones\",\n    title: \"Instrumentación de Decisiones\",\n    description: \"Aplicación efectiva de decisiones con criterios de eficacia, eficiencia y transparencia.\",\n    intro:\n      \"Pon a prueba tu criterio para decidir dentro de tu responsabilidad, asumir los efectos y mantener transparencia en el proceso.\",\n    reference: \"Sección 3.4 del Decreto 815 de 2018 - Instrumentación de decisiones.\",\n    questions: [\n      {\n        id: \"instrumentacion-decisiones-1\",\n        text: \"Una decisión fundamentada en la esfera de responsabilidad del servidor público debe basarse en:\",\n        options: [\n          { value: \"a\", label: \"Percepciones personales para actuar con rapidez.\" },\n          { value: \"b\", label: \"Información válida, rigurosa y criterios objetivos que garanticen transparencia.\" },\n          { value: \"c\", label: \"Preferencias políticas del superior inmediato.\" },\n          { value: \"d\", label: \"Opiniones informales del equipo de trabajo.\" },\n        ],\n        correctOption: \"b\",\n        score: 10,\n        explanation:\n          \"El decreto exige decisiones con criterios de economía, eficacia, eficiencia y transparencia, basadas en información válida.\",\n        review:\n          \"Consulta la sección Instrumentación de decisiones: la información válida y objetiva orienta decisiones responsables.\",\n      },",
  "  id: \"orientacion-resultado\",\n    title: \"Orientación a Resultados\",\n    description: \"Cumplimiento de objetivos con eficacia, calidad y uso de indicadores para medir avances.\",\n    intro:\n      \"Evalúa tu enfoque hacia metas claras, la gestión de riesgos y el uso de indicadores para asegurar el cumplimiento de compromisos.\",\n    reference: \"Sección 2.2 del Decreto 815 de 2018 - Orientación a resultados.\",\n    questions: [\n      {\n        id: \"orientacion-resultado-1\",\n        text: \"Trabajar con base en objetivos claros y realistas permite:\",\n        options: [\n          { value: \"a\", label: \"Dilatar la ejecución de actividades para ajustarse a cambios continuos.\" },\n          { value: \"b\", label: \"Alinear esfuerzos con metas verificables y cumplir responsabilidades a tiempo.\" },\n          { value: \"c\", label: \"Descartar indicadores de desempeño por complejos.\" },\n          { value: \"d\", label: \"Distribuir las tareas sin medir los avances.\" },\n        ],\n        correctOption: \"b\",\n        score: 10,\n        explanation:\n          \"La orientación a resultados exige objetivos claros y realistas para medir avances y cumplir compromisos con oportunidad.\",\n        review:\n          \"Revisa las conductas de orientación a resultados: fijar metas claras es la base del seguimiento efectivo.\",\n      },",
  "  id: \"orientacion-usuario\",\n    title: \"Orientación al Usuario y al Ciudadano\",\n    description: \"Atención oportuna, inclusiva y veraz a las necesidades de usuarios y ciudadanos.\",\n    intro:\n      \"Analiza tu capacidad para atender necesidades ciudadanas, diseñar mecanismos de participación y mantener un lenguaje inclusivo.\",\n    reference: \"Sección 2.3 del Decreto 815 de 2018 - Orientación al usuario y al ciudadano.\",\n    questions: [\n      {\n        id: \"orientacion-usuario-1\",\n        text: \"Establecer mecanismos para conocer inquietudes y necesidades ciudadanas permite:\",\n        options: [\n          { value: \"a\", label: \"Ajustar proyectos institucionales incorporando la visión de servicio público.\" },\n          { value: \"b\", label: \"Reducir la participación de los usuarios para agilizar trámites.\" },\n          { value: \"c\", label: \"Transferir la responsabilidad de atención a terceros.\" },\n          { value: \"d\", label: \"Limitar el servicio a los horarios más convenientes para la entidad.\" },\n        ],\n        correctOption: \"a\",\n        score: 10,\n        explanation:\n          \"La orientación al usuario exige incorporar las necesidades ciudadanas en la planeación institucional para garantizar servicio adecuado.\",\n        review:\n          \"Revisa la sección Orientación al usuario: los mecanismos de escucha alimentan proyectos pertinentes.\",\n      },",
  "  id: \"trabajo-equipo\",\n    title: \"Trabajo en Equipo\",\n    description: \"Colaboración integrada, respeto por la diversidad y responsabilidad compartida.\",\n    intro:\n      \"Evalúa tu capacidad para cumplir compromisos colectivos, integrar nuevos miembros y mantener comunicación respetuosa.\",\n    reference: \"Sección 2.5 del Decreto 815 de 2018 - Trabajo en equipo.\",\n    questions: [\n      {\n        id: \"trabajo-equipo-1\",\n        text: \"Cumplir los compromisos adquiridos con el equipo permite:\",\n        options: [\n          { value: \"a\", label: \"Evitar la asignación de nuevas responsabilidades.\" },\n          { value: \"b\", label: \"Contribuir al cumplimiento de metas institucionales comunes y fortalecer la confianza mutua.\" },\n          { value: \"c\", label: \"Delegar tareas pendientes en otros miembros.\" },\n          { value: \"d\", label: \"Reducir la planificación conjunta.\" },\n        ],\n        correctOption: \"b\",\n        score: 10,\n        explanation:\n          \"El trabajo en equipo se fundamenta en cumplir compromisos y responsabilizarse de los objetivos compartidos.\",\n        review:\n          \"Revisita la sección Trabajo en equipo: cumplir compromisos mantiene la confianza del equipo.\",\n      },"
]